SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG21/Include/efr32mg21_synth.h
/* Bit fields for SYNTH VCOGAIN */
#define _SYNTH_VCOGAIN_RESETVALUE                     0x00000077UL                              /**< Default value for SYNTH_VCOGAIN             */
#define _SYNTH_VCOGAIN_MASK                           0x000000FFUL                              /**< Mask for SYNTH_VCOGAIN                      */
#define _SYNTH_VCOGAIN_VCOKVCOARSE_SHIFT              0                                         /**< Shift value for SYNTH_VCOKVCOARSE           */
#define _SYNTH_VCOGAIN_VCOKVCOARSE_MASK               0xFUL                                     /**< Bit mask for SYNTH_VCOKVCOARSE              */
#define _SYNTH_VCOGAIN_VCOKVCOARSE_DEFAULT            0x00000007UL                              /**< Mode DEFAULT for SYNTH_VCOGAIN              */
#define SYNTH_VCOGAIN_VCOKVCOARSE_DEFAULT             (_SYNTH_VCOGAIN_VCOKVCOARSE_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_VCOGAIN      */
#define _SYNTH_VCOGAIN_VCOKVFINE_SHIFT                4                                         /**< Shift value for SYNTH_VCOKVFINE             */
#define _SYNTH_VCOGAIN_VCOKVFINE_MASK                 0xF0UL                                    /**< Bit mask for SYNTH_VCOKVFINE                */
#define _SYNTH_VCOGAIN_VCOKVFINE_DEFAULT              0x00000007UL                              /**< Mode DEFAULT for SYNTH_VCOGAIN              */
#define SYNTH_VCOGAIN_VCOKVFINE_DEFAULT               (_SYNTH_VCOGAIN_VCOKVFINE_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_VCOGAIN      */

/* Bit fields for SYNTH IF */
#define _SYNTH_IF_RESETVALUE                          0x00000000UL                        /**< Default value for SYNTH_IF                  */
#define _SYNTH_IF_MASK                                0x00000237UL                        /**< Mask for SYNTH_IF                           */
#define SYNTH_IF_LOCKED                               (0x1UL << 0)                        /**< Synthesizer locked Interrupt Flag           */
#define _SYNTH_IF_LOCKED_SHIFT                        0                                   /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_IF_LOCKED_MASK                         0x1UL                               /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_IF_LOCKED_DEFAULT                      0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_LOCKED_DEFAULT                       (_SYNTH_IF_LOCKED_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYNTH_IF           */
#define SYNTH_IF_UNLOCKED                             (0x1UL << 1)                        /**< Synthesizer unlocked Interrupt Flag         */
#define _SYNTH_IF_UNLOCKED_SHIFT                      1                                   /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_IF_UNLOCKED_MASK                       0x2UL                               /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_IF_UNLOCKED_DEFAULT                    0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_UNLOCKED_DEFAULT                     (_SYNTH_IF_UNLOCKED_DEFAULT << 1)   /**< Shifted mode DEFAULT for SYNTH_IF           */
#define SYNTH_IF_CAPCALDONE                           (0x1UL << 2)                        /**< Capacitor calibration Interrupt Flag        */
#define _SYNTH_IF_CAPCALDONE_SHIFT                    2                                   /**< Shift value for SYNTH_CAPCALDONE            */
#define _SYNTH_IF_CAPCALDONE_MASK                     0x4UL                               /**< Bit mask for SYNTH_CAPCALDONE               */
#define _SYNTH_IF_CAPCALDONE_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_CAPCALDONE_DEFAULT                   (_SYNTH_IF_CAPCALDONE_DEFAULT << 2) /**< Shifted mode DEFAULT for SYNTH_IF           */
#define SYNTH_IF_VCOHIGH                              (0x1UL << 4)                        /**< VCO high voltage Interrupt Flag             */
#define _SYNTH_IF_VCOHIGH_SHIFT                       4                                   /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_IF_VCOHIGH_MASK                        0x10UL                              /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_IF_VCOHIGH_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_VCOHIGH_DEFAULT                      (_SYNTH_IF_VCOHIGH_DEFAULT << 4)    /**< Shifted mode DEFAULT for SYNTH_IF           */
#define SYNTH_IF_VCOLOW                               (0x1UL << 5)                        /**< VCO low voltage Interrupt Flag              */
#define _SYNTH_IF_VCOLOW_SHIFT                        5                                   /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_IF_VCOLOW_MASK                         0x20UL                              /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_IF_VCOLOW_DEFAULT                      0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_VCOLOW_DEFAULT                       (_SYNTH_IF_VCOLOW_DEFAULT << 5)     /**< Shifted mode DEFAULT for SYNTH_IF           */
#define SYNTH_IF_LOCNTDONE                            (0x1UL << 9)                        /**< LOCNT measurement done Interrupt Flag       */
#define _SYNTH_IF_LOCNTDONE_SHIFT                     9                                   /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_IF_LOCNTDONE_MASK                      0x200UL                             /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_IF_LOCNTDONE_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SYNTH_IF                   */
#define SYNTH_IF_LOCNTDONE_DEFAULT                    (_SYNTH_IF_LOCNTDONE_DEFAULT << 9)  /**< Shifted mode DEFAULT for SYNTH_IF           */

/* Bit fields for SYNTH IEN */
#define _SYNTH_IEN_RESETVALUE                         0x00000000UL                         /**< Default value for SYNTH_IEN                 */
#define _SYNTH_IEN_MASK                               0x00000237UL                         /**< Mask for SYNTH_IEN                          */
#define SYNTH_IEN_LOCKED                              (0x1UL << 0)                         /**< LOCKED Interrupt Enable                     */
#define _SYNTH_IEN_LOCKED_SHIFT                       0                                    /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_IEN_LOCKED_MASK                        0x1UL                                /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_IEN_LOCKED_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_LOCKED_DEFAULT                      (_SYNTH_IEN_LOCKED_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYNTH_IEN          */
#define SYNTH_IEN_UNLOCKED                            (0x1UL << 1)                         /**< UNLOCKED Interrupt Enable                   */
#define _SYNTH_IEN_UNLOCKED_SHIFT                     1                                    /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_IEN_UNLOCKED_MASK                      0x2UL                                /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_IEN_UNLOCKED_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_UNLOCKED_DEFAULT                    (_SYNTH_IEN_UNLOCKED_DEFAULT << 1)   /**< Shifted mode DEFAULT for SYNTH_IEN          */
#define SYNTH_IEN_CAPCALDONE                          (0x1UL << 2)                         /**< CAPCALDONE Interrupt Enable                 */
#define _SYNTH_IEN_CAPCALDONE_SHIFT                   2                                    /**< Shift value for SYNTH_CAPCALDONE            */
#define _SYNTH_IEN_CAPCALDONE_MASK                    0x4UL                                /**< Bit mask for SYNTH_CAPCALDONE               */
#define _SYNTH_IEN_CAPCALDONE_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_CAPCALDONE_DEFAULT                  (_SYNTH_IEN_CAPCALDONE_DEFAULT << 2) /**< Shifted mode DEFAULT for SYNTH_IEN          */
#define SYNTH_IEN_VCOHIGH                             (0x1UL << 4)                         /**< VCOHIGH Interrupt Enable                    */
#define _SYNTH_IEN_VCOHIGH_SHIFT                      4                                    /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_IEN_VCOHIGH_MASK                       0x10UL                               /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_IEN_VCOHIGH_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_VCOHIGH_DEFAULT                     (_SYNTH_IEN_VCOHIGH_DEFAULT << 4)    /**< Shifted mode DEFAULT for SYNTH_IEN          */
#define SYNTH_IEN_VCOLOW                              (0x1UL << 5)                         /**< VCOLOW Interrupt Enable                     */
#define _SYNTH_IEN_VCOLOW_SHIFT                       5                                    /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_IEN_VCOLOW_MASK                        0x20UL                               /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_IEN_VCOLOW_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_VCOLOW_DEFAULT                      (_SYNTH_IEN_VCOLOW_DEFAULT << 5)     /**< Shifted mode DEFAULT for SYNTH_IEN          */
#define SYNTH_IEN_LOCNTDONE                           (0x1UL << 9)                         /**< LOCNTDONE Interrupt Enable                  */
#define _SYNTH_IEN_LOCNTDONE_SHIFT                    9                                    /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_IEN_LOCNTDONE_MASK                     0x200UL                              /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_IEN_LOCNTDONE_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for SYNTH_IEN                  */
#define SYNTH_IEN_LOCNTDONE_DEFAULT                   (_SYNTH_IEN_LOCNTDONE_DEFAULT << 9)  /**< Shifted mode DEFAULT for SYNTH_IEN          */

